<?php include('header.php') ?>
		<div class="middle" id="articlePage">
		<div class="paginationBarWrapper">
			<a class="hideBar"></a>
			<div class="paginationBar">
			<ul>
				<li><a>1</a></li>
				<li><a>2</a></li>
				<li><a>3</a></li>
				<li><a>4</a></li>
				<li><a>5</a></li>
				<li><a>6</a></li>
				<li><a>7</a></li>
				<li><a>8</a></li>
				<li><a>9</a></li>
				<li><a>10</a></li>
				<li><a>11</a></li>
				<li><a>12</a></li>
				<li class="active"><a>13</a></li>
				<li><a>14</a></li>
				<li><a>15</a></li>
				<li><a>16</a></li>
				<li><a>17</a></li>
				<li><a>18</a></li>

			</ul>
			</div>
		
		</div>
		<div class="contentWrapper social"></div>
		<div class="contentWrapper article">	
		<div class="year">1987</div>
        	<table class="articleHeader" width="100%">
            <tr>
                <td width="100%"><h1>Женщины в IT</h1>
					<h2>Первый в континентальной Европе компьютер</h2>
					<div class="annotation"> Мало кто знает, что именно в Киеве был создан первый в Советском Союзе и континентальной Европе компьютер с хранимой в памяти программой, который, по сути, является прадедушкой современных ПК. Ведь именно Малая Электронная Счетная Машина (МЭСМ), придуманная и разработанная с нуля академиком Лебедевым, заложила основы построения всех электронно-вычислительных машин (ЭВМ), которые без принципиальных изменений используются и в современной вычислительной технике. </div></td>
                <td class="illustration">
					<img src="images/illustration-1.png" width="401" height="424" /></td>
            </tr>
            </table>
          
            <table width="100%">
            	<tr>
                <td class="markers">
				<p>
				Появление в конце 40-х годов
ХХ века компьютеров с хранимой
в памяти программой было завершающим и едва ли не самым важным шагом в развитии цифровой вычислительной техники. 
				</p>
				</td>
                <td class="content">
				<p>
                Мало кто знает, что именно в Киеве был создан первый в Советском Союзе и континентальной Европе компьютер с хранимой в памяти программой, который, по сути, является прадедушкой современных ПК. Ведь именно Малая Электронная Счетная Машина (МЭСМ), придуманная и разработанная с нуля академиком Лебедевым, заложила основы построения всех электронно-вычислительных машин (ЭВМ), которые без принципиальных изменений используются и в современной вычислительной технике.		
				</p>
				<p>
                Мало кто знает, что именно в Киеве был создан первый в Советском Союзе и континентальной Европе компьютер с хранимой в памяти программой, который, по сути, является прадедушкой современных ПК. Ведь именно Малая Электронная Счетная Машина (МЭСМ), придуманная и разработанная с нуля академиком Лебедевым, заложила основы построения всех электронно-вычислительных машин (ЭВМ), которые без принципиальных изменений используются и в современной вычислительной технике.		
				</p>
							
                </td>
              </tr>
			  <tr>
			  <td colspan="2">
			  <blockquote>
				Ученым, работавшим над МЭСМ, пришлось создавать свои рабочие места с нуля — и лабораторию, и металлообрабатывающую мастерскую, и даже электростанцию. Все работали посменно
по 24 часа в сутки, при этом дисциплина была железная. 
				</blockquote>	
				</td>
			  </tr>			  
				<tr>
                <td class="markers">
				<p>
				<img src="images/persons/lebedev/lebedev-small.png" width="140" height="140" /> 
				<a href="#">Лебедев</a><span class="personYears">1988 — 1934</span></p>
				<p>
				Появление в конце 40-х годов
ХХ века компьютеров с хранимой
в памяти программой было завершающим и едва ли не самым важным шагом в развитии цифровой вычислительной техники. 
				</p>
				</td>
                <td class="content">
				<p>
                Мало кто знает, что именно в Киеве был создан первый в Советском Союзе и континентальной Европе компьютер с хранимой в памяти программой, который, по сути, является прадедушкой современных ПК. Ведь именно Малая Электронная Счетная Машина (МЭСМ), придуманная и разработанная с нуля академиком Лебедевым, заложила основы построения всех электронно-вычислительных машин (ЭВМ), которые без принципиальных изменений используются и в современной вычислительной технике.		
				</p>
				<p>
                Мало кто знает, что именно в Киеве был создан первый в Советском Союзе и континентальной Европе компьютер с хранимой в памяти программой, который, по сути, является прадедушкой современных ПК. Ведь именно Малая Электронная Счетная Машина (МЭСМ), придуманная и разработанная с нуля академиком Лебедевым, заложила основы построения всех электронно-вычислительных машин (ЭВМ), которые без принципиальных изменений используются и в современной вычислительной технике.		
				</p>
							
                </td>
              </tr>
			  <tr>			  
			  
            </table>

		</div>
<?php include('footer.php') ?>
