/*Забытая машина Щукарева*/var p1_1 = 'Хрущев Павел Дмитриевич (1849 - 1909) профессор Харьковского университета. В 1897 г. он воспроизвел "логическое пианино" - машину, изобретенную в 1870 г. английским ученым математиком Вильямом Стенли Джевансом (1835-1882)';
var p1_2 = 'Щукарев Александр Николаевич (1864-1936) профессор Харьковского политехнического института. Построил "машину логического мышления", способную механически осуществлять простые логические выводы на основе исходных смысловых посылок';
var p1_3 = 'Забытая “Машина логического мышления” профессора А.Н.Щукарева.1914 год.';
/*p-n*/var p2_1 = 'Вадим Евгеньевич Лашкарев. Основоположник микроэлектронных технологий в Украине.(1903-1974). В 1941 году первый в мире экспериментально обнаружил p-n переход и раскрыл механизм электронно-дырочной диффузии, на основе которых в годы Великой Отечественной войны были созданы первые в СССР полупроводниковые диоды, а в начале 50-х годов - первые в Украине полупроводниковые триоды.';
var p2_2 = 'Купрокс-диод на p-n переходе, медь (Cu) - окись меди (Cu2O). Разработан под руководством Вадима Евгеньевича Лашкарева и выпускался на военном заводе в Уфе во время Великой Отечественной войны 1941-1945 гг. Использовался в военных полевых радиостанциях.';
var p2_3 = 'Отдел фотопроводимости Института полупроводников АН Украины. Академик и его ученики. Начало 60-х годов XX-го века.';
var p2_4 = 'Вадим Евгеньевич Лашкарев и президент АН СССР Сергей Иванович Вавилов в президиуме конференции по люминесценции. Май 1948 года';
var p2_5 = 'Вадим Евгеньевич Лашкарев среди преподавателей основанной им кафедры физики полупроводников Киевского государственного университета. Начало 50-х годов XX-го века.';
/*MESM*/var p3_1 = 'Сергей Алексеевич Лебедев. Академик АН Украины и АН СССР. Директор Института электротехники АН Украины в 1946 1952 гг. Создатель первого в континентальной Европе компьютера МЭСМ. Основоположник отечественного компьютеростроения. 1902 1974';
var p3_2 = 'Малая электронная счетная машина МЭСМ. Снимок – 1951 год. Сзади пульта: Л.Н. Дашевский и З.С. Зорина Рапота. За пультом слева направо: Л.М. Абалышникова, Т.И. Пецух, Е.Е. Дедешко. Национальная академия наук УССР, Киев';
var p3_3 = 'Малая электронная счетная машина МЭСМ.Снимок – 1951 год Сзади пульта: Л.Н. Дашевский и З.С. Зорина Рапота. За пультом слева направо: Л.М. Абалышникова, Т.И. Пецух, Е.Е. Дедешко Национальная академия наук УССР, Киев';
var p3_4 = 'Здание в пригороде Киева - Феофании, где располагалась лаборатория С.А.Лебедева и была построена МЭСМ';
var p3_5 = 'Старший научный сотрудник Лев Наумович Дашевский (1916-1988)';
var p3_6 = 'Двадцать пять лет со времени ввода МЭСМ в эксплуатацию. Слева направо в первом ряду: Г.П. Пархоменко, Е.А. Шкабара, Л.Н. Дашевский, Л.М. Абалышникова, Р.Я. Черняк. Во втором ряду: И.Т. Пархоменко, В.В. Крайницкий, Е.Е. Дедешко, М.М. Пиневич, С.Б. Розенцвайг, С.Б. Погребинский, М.А. Беляев, А.Г. Семеновский. Октябрь 1976 год';
var p3_7 = 'Детали Малой электронной счетной машины МЭСМ: электронные лампы, сопротивления, конденсаторы';
var p3_8 = 'Старший научный сотрудник Шкабара Екатерина Алексеевна (1913-2002)';


/*Днепр*/var p4_1 = 'Внешний вид стандартного субблока УМШН "Днепр" та лицевая и оборотная стороны стандартной ячейки арифметического устройства УМШН "Днепр"';

var p4_2 = 'Отладка первого образца УМШН "Днепр"';
var p4_3 = 'УМШН "Днепр". ВДНХ Украины. Киев. Павильон "Наука".Фотография на память. Слева направо: В.И. Скурихин, Л.А. Корытная, Л.А. Жук, В.С. Каленчук, В.М. Глушков, Б.Н. Малиновский. 1962 г';
var p4_4 = 'Комплекс из двух компьютеров "Днепр" (установлен за экраном) в Центре управления космическими полетами. Информация со 150 датчиков поступает в комплекс, который выдает на экран траекторию спутника (космического корабля). На фото надпись: "Уважаемому Владимиру Ильичу Скурихину в память о совместных работах, декабрь 1974 г."';
var p4_5 = 'Двухмашинный компьютерный комплекс для автоматической обработки и моделирования физиологических процессов. Комплекс включал два компьютера – "Днепр" и "Саратов". Был оснащен разными устройствами ввода физиологической информации, как в реальном времени, так и с промежуточных носителей: магнитной ленты и чернильной записи на бумажной. Институт физиологии имени А.А. Богомольца. Руководитель работ Екатерина Алексеевна Шкабара. 70-е гг.. ХХ-го столетия';
var p4_6 = 'Соратники. Слева направо: В.Боюн (Киев), А.Смирнов (Москва), Б.Малиновский, А.Палагин (Киев). Совместное заседание Министерства промышленных средств связи и Академии наук СССР. 1976 г.';
var p4_7 = 'Официальным символом признания трехлетнего комплекса работ по созданию, запуску в серию и использованию "Днепров", стал один из первых образцов УМШН, хранящийся в Московском Государственном политехническом музее, признанный "Памятником науки и техники I-ой категории", о чем говорит сертификат №881, выданный 12.11.2008 г.';
var p4_8 = 'Памятник советской науки и техники: Государственный Политехнический музей (г.Москва). Сертификат N 881 от 12.11.2008 г. Первая в Советском Союзе полупроводниковая управляющая машина широкого назначения "Днепр". Передана музею в 1971 г. после 20 лет эксплуатации в одном из институтов АН СССР';
var p4_9 = 'Соратники. Слева направо: В.Боюн (Киев), А.Смирнов (Москва), Б.Малиновский, А.Палагин (Киев). Совместное заседание Министерства промышленных средств связи и Академии наук СССР. 1976 г.';

/*MIRS*/var p5_1 = 'Проминь-1';
var p5_2 = 'В.М. Глушков за пультом компьютера "Промінь", Погребинский Б.С - второй слева. В 1959 году В.М. Глушков предложил программу работ по созданию машин для инженерных расчетов. Она была начата с разработки макета цифрового вычислительного автомата МИМ. Затем в 1963 году была закончена разработка и началось серийное производство первой машины этого типа "Промiнь".';
var p5_3 = 'Вслед за компьютером "Промінь" была создана машина для инженерных расчетов МИР 1. В ней было использовано ступенчатое микропрограммное управление. В 1967 году на выставке в Лондоне, где демонстрировалась МИР 1, она была куплена американской фирмой IBM - крупнейшей в США, являющейся поставщиком почти 80% вычислительной техники для всего мира. Это была первая и, к сожалению, последняя покупка советской электронной машины американской кампанией. 1966 год';
var p5_4 = 'Академик, профессор, доктор физ.-мат. наук, лауреат Государственной премии СССР, Государственной премии Украины, президиальной премии им.В.М.Глушкова, заведующий отделом Института кибернетики НАН Украины А.А. Летичевский – ближайший ученик В.М.Глушкова, наследник и продолжатель его творчества в области информационных технологий. Крупный ученый в области прикладной теории алгоритмов и алгебраического проектирования. Автор более 200 статей и изобретений. Один из ведущих создателей языка высокого уровня "Аналитик", ориентированного на автоматизацию аналитических преобразований, участник разработки программного обеспечения машин семейства МИР, а затем разработки структуры и архитектуры рекурсивного суперкомпьютера. Александр Адольфович Летичевский. Фото 60-х годов XX-го века';
var p5_5 = 'Машина для инженерных расчетов МИР-2. В компьютере МИР 2 впервые в практике отечественного математического машиностроения был реализован диалоговый режим работы, использующий дисплей со световым пером и доступный для инженеров язык программирования "АНАЛИТИК". 1969 год';
var p5_6 = 'Машина для инженерных расчетов МИР-3. 1971 год. Главный конструктор машин "Промінь" и семейства "МИР"  - С.Б. Погребинский. Машины семейства "МИР", созданные по идеям В.М. Глушкова, стали предшественниками персональных компьютеров.';
var p5_7 = 'Машина для инженерных расчетов МИР-2. В компьютере МИР 2 впервые в практике отечественного математического машиностроения был реализован диалоговый режим работы, использующий дисплей со световым пером и доступный для инженеров язык программирования "АНАЛИТИК". 1969 год';


var p6_1 = 'Иван Васильевич Кудрявцев с гостями Научно производственного объединения "Квант", 1965 год';

/*Karat*/
var p7_1 = 'Вилен Николаевич Плотников. (1930-2000). Главный конструктор семейства специализированных компьютеров Карат для систем вооружения, наблюдения и навигации военно-морского, надводного и подводного флотов, а также систем навигации торгового флота бывшего СССР.';

var p7_2 = 'Модернизированный компьютер “Карат”. 1981 г. в ”Кванте” были разработаны 15 модификаций компьютеров семейства “Карат”. Подготовлено программное обеспечение объемом около 5 млн.команд. Изготовлено свыше 1500 “Каратов”. Унифицированные модификации семейства компьютеров “Карат” использовались более, чем в 60 типах систем.';
var p7_3 = 'Разработчики первой в бывшем Советском Союзе полностью автоматизированной системы на базе компьютера “Карат” для отечественных супер-танкеров (система “Бриз”). Слева направо: В.Т.Кондрашихин, А.А.Кошевой, А.А.Якушенков, В.Ю.Лапий, Б.П.Чернов. ';
var p7_4 = 'Атомный ледокол "Россия", где была установлена система судовождения "Бирюза" на базе компьютера “Карат” (разработка НПО "КВАНТ"). На фотографии надпись в адрес разработчика от командира корабля: "Кошевому А.А. Спасибо за "Бирюзу"! а/л "Россия" 17.02.86г. Карское море. о.Диксон. Ю.Юрченко".';
/*Zvezda*/var p8_1 ='Олег Михайлович Алещенко на палубе военного корабля во время испытаний гидроакустической системы "Звезда", разработанной под его руководством в Киевском НИИ "ГИДРОПРИБОР" Минсудопрома СССР. Под "присмотром" французского фрегата. 1986 год';
var p8_2 ='Лапий Виктор Юрьевич (1934-2002). C 1958 по 1976 год работал в НИИ радиоэлектроники Минсудопрома СССР (НПО "КВАНТ"). Видный специалист по цифровой обработке радиолакационных сигналов. 1963 год';
var p8_3 ='Заведующий отделом Института кибернетики имені В.М.Глушкова д.т.н. В.Н. Коваль. В начале 60-х годов занимался распознованием гидроакустических сигналов с использованием компьютера "Днепр". Результаты эксперимента были использованы при создании цифровых гидроакустических комплексов обнаружения подводных объектов. 1990 г.';
var p8_4 ='Многомашинный гидроакустический комплекс "Звезда" (разработка НИИ "ГИДРОПРИБОР" Минсудопрома СССР) на базе компьютера "Атака". Главный конструктор Алещенко Олег Михайлович, заместитель главного конструктора по разработке программно-технического комплекса Лапий Виктор Юрьевич. Весь комплекс занимал 200 приборных шкафов. Для обеспечения работы вычислительной части (она занимала 40 шкафов) были подготовлены программы объемом около миллиона команд. В 1985 году комплекс был принят на вооружение и передан в серийное производство. 1985 год. Перед уходом из жизни Олег Михайлович Алещенко подарил Малиновскому Б.Н., главному конструктору УМШН "Днепр", цветную картину с изображением гидролокатора "Звезда" на память об использовании УМШН в первом эксперименте на Черном море.';
var p8_5 ='Адмирал флота Сергей Георгиевич Горшков (слева) во время посещения "Кванта" и Иван Васильевич Кудрявцев. 60-е годы XX-го века.';
var p8_6 ='Мультипроцессорная вычислительная система 1801 3М1Г для обработки гидроакустических сигналов на базе микропроцессоров 585. Разработка НИИ "ГИДРОПРИБОР" Минсудопрома СССР, В,Ю.Лапий, В.В.Крамской, Киев. 1984 год';
/*Elektronmash*/var p9_1 ='Киевское научно-производственное объединение "Электронмаш" (ранее завод ВУМ) создано в 1965 году по инициативе Института кибернетики АН Украины, поддержанной правительством.';
var p9_2 ='Аполлинарий Федорович Незабитовский - директор НПО "Электронмаш" с 1965 по 1986 год – "звездные" годы НПО "Электронмаш". К концу 70-х годов в НПО работали более 10 тысяч человек. Объединение стало крупнейшим в бывшем СССР поставщиком управляющих и вычислительных машин.';
var p9_3 ='Управляюшщий вычислительный комплекс M4030-1. Создан в 1973-м году в НПО "Электронмаш". Главный конструктор С.С. Забара.';
var p9_4 ='Забара Станислав Сергеевич, заместитель директора c 1972 г., а затем в течение 20 лет директор Научно-исследовательского института периферийных устройств НПО "Электронмаш". Главный конструктор ряда машин и многих периферийных устройств, выпущенных в НПО "Электронмаш", а также средств автоматизации проектирования и контроля средств вычислительной техники.';
var p9_5 ='Ученые Института кибернетики АН Украины в НПО "Электронмаш". 1989 г. Слева направо: И.Д. Войтович, Б.Н. Малиновский, С.С. Забара, В.П. Соловьев, С.Б. Погребинский. Большую роль в развитии НПО сыграла помощь ученых ИК АН Украины.';
var p9_6 ='Управляюшщий вычислительный комплекс единой системы малых компьютеров СM-4. В 70-х – 80-х годах НПО было сориентировано министерством приборостроения СССР на выпуск машин семейства СМ ЭВМ.';
/*Импульс*/var p10_1 ='Резанов Владислав Васильевич - бессменный с 1958 по 1995 год научный руководитель НПО "Импульс" (ранее Северодонецкий филиал СКБ 245 Министерства приборостроения СССР). Благодаря талантливым руководителям и самоотверженной работе молодых специалистов, приехавших в Северодонецк в конце 50-х годов в 60-е – 80-е  годы были создан широкий набор средств системотехники, управляющие машины и комплексы для автоматизации производства, научного эксперимента, атомных и тепловых электростанций и др., обеспечившие большую часть потребностей в них бывшего СССР. Северодонецк';
var p10_2 ='Феррит-транзисторная управляющая машина УМ-1 системы СОУ-1 для централизованного контроля и автоматического управления в системах комплексной автоматизации агрегатов и цехов химической, нефтеперерабатывающей, нефтехимической, металлургической и других отраслей промышленности. Имеет мощное устройство связи с объектом управления – самое совершенное на то время. 60-е годы XX-го века.';
var p10_3 ='Вычислительная управляющая система М-6000 АСВТ-М (модернизированной). "Рабочая лошадка" для многих тысяч управляющих систем и комплексов различного назначения. 70-е годы XX-го века.';
var p10_4 ='Экспедиционный геофизический вычислительный комплекс на интегральных схемах ПС-2000 производительностью 200 млн.опер./сек. 80-е годы XX-го века.';
var p10_5 ='Управляющий комплекс СМ-1 системы малых машин СМ ЭВМ. 80-е годы XX-го века.';
var p10_6 ='Региональный геофизический вычислительный комплекс ПС-3000. Производительность - 3 млрд.опер./сек. Начало 90-х годов XX-го века.';
/*Кристалл*/var p11_1 ='Министр электронной промышленности А.И.Шокин и первый директор НИИ "Микроприбор" и Генеральный директор "Кристалла" С.А.Моралев (в центре). Киев. Конец 60-х годов XX-го века.';
var p11_2 = 'НИИ "Микроприбор" – первое детище С.А. Моралева. 1967 год';
var p11_3 = 'Первый в Европе микрокалькулятор, разработанный в НИИ "Микроприбор". 1970 год';
var p11_4 = 'Участок электротренировки микрокалькуляторов НПО "Кристалл". 1979 год';
var p11_5 = 'Серийное производство, участок сборки микрокалькуляторов. НПО "Кристалл"в 70-х годах XX-го века выпустило сотни тысяч микрокалькуляторов и БИС средней степени интеграции.';
var p11_6 = 'Интегральная микросхема на К-МОП-транзисторах с регулярной структурой, со средней степенью интеграции. 1970 год';
/*Биокибернетика Амосова*/var p12_1 = 'Основоположник биокибернетики в Украине Николай Михайлович Амосов во время доклада на семинаре в Институте кибернетики АН Украины. 70-е годы XX-го века.';
var p12_2 = 'Сотрудники отдела Института кибернетики АН Украины, руководимого Н.М. Амосовым, В.М. Белов, Э.М. Куссуль (справа) готовят робот ТАИР к "прогулке".';
var p12_3 = 'Первый в СССР автономный транспортный робот ТАИР на "прогулке". Робот представлял собой трехколесную самоходную тележку, снабженную системой датчиков. Робот мог двигаться в естественной среде обходя препятствия. Управлялся аппаратно реализованной нейронной сетью(узлы сети - специальные электронные схемы, собранные на транзисторах; связи между узлами - резисторы). 1975 г.';
var p12_4 = 'Робот МАВР. Исследование и совершенствование алгоритмов управления роботом при движении в естественной среде было продолжено в 1984-1986 гг. на макете МАВР. Эта работа проводилась по заказу Министерства обороны СССР и была направлена на создание автономного робота, способного целенаправленно передвигаться в условиях сложной пересеченной местности. 1984 - 1986 гг.';
var p12_5 = 'Первый в СССР нейрокомпьютер был разработан в 1988-1989 гг. на основе идеологии ансамблевых стохастических нейросетей. Руководитель работ Э.М. Куссуль. Отдел Н.М. Амосова. Первый макет нейрокомпьютера (1989 г.) был создан на отечественной элементной базе и представлял собой приставку к персональному компьютеру.';
var p12_6 = 'Последний визит Николая Михайловича Амосова в Институт кибернетики НАНУ. Слева направо: В.Л. Алексеев, Г.И. Федченко, Т.Н. Байдык, Л.М. Касаткина, Н.М. Амосов, С.Я. Артыкуца (за Амосовым), А.М. Касаткин (на переднем плане), В.И. Гриценко, Д.А. Рачковский, В.В. Лукович, С.А. Талаев, А.Д. Гольцев. Март, 2001 г.';
/*Ракеты*/var p13_1 = 'Сергеев Владимир Григорьевич – руководитель Харьковского научно-производственного объединения "Хартрон" и Главный конструктор систем управления ракетных комплексов с 1960 по 1986 год. 80-е годы XX-го века.';
var p13_2 = 'Анатолий Иванович Кривоносов - главный конструктор бортовых компьютеров разработанных в НПО "Хартрон". Они устанавливались на ракетах и ракетных комплексах стратегического назначения в бывшем СССР.';
var p13_3 = 'Айзенберг Яков Ейнович – руководил в "Хартроне" разработкой алгоритмов управления для всех поколений ракет выпущенных "Южмашем". С 1986 года до середины 90-х годов генеральный директор и генеральный конструктор научно-производственного объединения "Хартрон".';
var p13_4 = 'В 80-е годы в Научно-производственном объединение "Хартрон" была выполнена одна из самых масштабных разработок - система управления сверхтяжелой ракеты носителя "Энергия", а на Производственном объединении "Киевский радиозавод" была создана мощная производственная база и изготовлены экспериментальные и штатные комплекты этой аппаратуры.';
var p13_5 = 'Министр общего машиностроения С.А. Афанасьев (в центре), генеральный конструктор КБ "Южное" С.Н.Конюхов (справа), главный конструктор ракеты СС-18 ("Сатана") С.И. Ус (слева). Днепропетровск. 80-е годы XX-го века.';
var p13_6 = 'Бортовая аппаратура, созданная на Киевском радиозаводе, обеспечила разработку наземного комплекса с высокой степенью автоматизации проверок, предстартовой подготовки и пуска ракеты"Циклон". Только за период 1986 1996 годы было осуществлено более 100 пусков ракеты "Циклон". Пуск ракеты-носителя "Циклон". 1986 год.';
var p13_7 = 'Летчики-космонавты СССР В.М. Жолобов и П.Р. Попович с А.М. Войтенко, А.П. Завалишиным, главным инженером ПО "Киевский радиозавод" Б.Е. Василенко на открытии Музея истории космонавтики в г. Киеве. 80-е годы XX-го век';
/*ОГАС*/var p14_1 = 'Академик Виктор Михайлович Глушков. 24.VIII.1923 – 30.I.1982. Основатель и первый директор Института кибернетики АН Украины. Основоположник информационных технологий в Украине и бывшем Советском Союзе';
var p14_2 = 'Анатолий Иванович Китов - выдающийся ученый в области информационно-поисковых систем, алгоритмических языков и автоматизированных систем управления, заложивший основы отечественной школы программирования и применения ЭВМ для решения военных и народно-хозяйственных задач. Автор 12 монографий и учебников, переведенных на 9 иностранных языков.';
var p14_3 = 'Президент АН СССР Мстислав Всеволодович Келдыш (слева) –и Виктор Михайлович Глушков. Общее собрание АН СССР. 60 е годы XX го века';
var p14_4 = 'В.М.Глушков (в центре) на встрече в Туле с главными конструкторами АСУ оборонных предприятий. ОГАС не погас! 1980 год';
var p14_5 = 'Директор Института кибернетики АН Украины академик В.М. Глушков встречает гостей – группу ученых, приехавших из США. За время с 1962 по 1982 г., когда В.М. Глушков был директором, институт посетили тысячи ученых из различных городов бывшего Советского Союза, стран Европы, Азии, Америки. В свою очередь В.М. Глушков за эти годы посетил большинство стран мира';
/*Досуг*/var p15_1 = 'Игра в волейбол. Феофания. Лето 1957 года.';
var p15_2 = 'Сергей Алексеевич в редкие часы отдыха за пианино. 60-е годы XX-го столетия';
var p15_3 = 'Сергей Алексеевич Лебедев в своем саду.';
var p15_4 = 'Семья Лебедевых.';
var p15_5 = 'Глушков В.М. Редкие минуты отдыха.';
var p15_6 = 'Глушков В.М.';
var p15_7 = 'Глушков В.М. с супругой.';
var p15_8 = 'Амосов Н.М.';
var p15_9 = 'Амосов Н.М. за компьютером.';
var p15_aa = 'Николай Михайлович и Чарри';
var p15_bb = 'Амосов с внучкой';
$(document).ready(function(e){		/*$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription1-1', p1_1) )});
		$('.content img[alt="#photodescription1-1"]').attr('alt', p1_1);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription1-2', p1_2) )});
		$('.content img[alt="#photodescription1-2"]').attr('alt', p1_2);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription1-3', p1_3) )});
		$('.content img[alt="#photodescription1-3"]').attr('alt', p1_3);*/
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription2-1', p2_1) )});
		$('.content img[alt="#photodescription2-1"]').attr('alt', p2_1);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription2-2', p2_2) )});
		$('.content img[alt="#photodescription2-2"]').attr('alt', p2_2);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription2-3', p2_3) )});
		$('.content img[alt="#photodescription2-3"]').attr('alt', p2_3);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription2-4', p2_4) )});
		$('.content img[alt="#photodescription2-4"]').attr('alt', p2_4);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription2-5', p2_5) )});
		$('.content img[alt="#photodescription2-5"]').attr('alt', p2_5);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-1', p3_1) )});
		$('.content img[alt="#photodescription3-1"]').attr('alt', p3_1);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-2', p3_2) )});
		$('.content img[alt="#photodescription3-2"]').attr('alt', p3_2);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-3', p3_3) )});
		$('.content img[alt="#photodescription3-3"]').attr('alt', p3_3);
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-4', p3_4) )});
		$('.content img[alt="#photodescription3-4"]').attr('alt', p3_4);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-5', p3_5) )});
		$('.content img[alt="#photodescription3-5"]').attr('alt', p3_5);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-6', p3_6) )});
		$('.content img[alt="#photodescription3-6"]').attr('alt', p3_6);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-7', p3_7) )});
		$('.content img[alt="#photodescription3-7"]').attr('alt', p3_7);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription3-8', p3_8) )});
		$('.content img[alt="#photodescription3-8"]').attr('alt', p3_8);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-1', p4_1) )});
		$('.content img[alt="#photodescription4-1"]').attr('alt', p4_1);

		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-2', p4_2) )});
		$('.content img[alt="#photodescription4-2"]').attr('alt', p4_2);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-3', p4_3) )});
		$('.content img[alt="#photodescription4-3"]').attr('alt', p4_3);

		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-4', p4_4) )});
		$('.content img[alt="#photodescription4-4"]').attr('alt', p4_4);

		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-5', p4_5) )});
		$('.content img[alt="#photodescription4-5"]').attr('alt', p4_5);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-6', p4_6) )});
		$('.content img[alt="#photodescription4-6"]').attr('alt', p4_6);

		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-7', p4_7) )});
		$('.content img[alt="#photodescription4-7"]').attr('alt', p4_7);

		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-8', p4_8) )});
		$('.content img[alt="#photodescription4-8"]').attr('alt', p4_8);
		
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription4-9', p4_9) )});
		$('.content img[alt="#photodescription4-9"]').attr('alt', p4_9);

		
		/*5*/
		$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-1', p5_1) )});
$('.content img[alt="#photodescription5-1"]').attr('alt', p5_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-2', p5_2) )});
$('.content img[alt="#photodescription5-2"]').attr('alt', p5_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-3', p5_3) )});
$('.content img[alt="#photodescription5-3"]').attr('alt', p5_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-4', p5_4) )});
$('.content img[alt="#photodescription5-4"]').attr('alt', p5_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-5', p5_5) )});
$('.content img[alt="#photodescription5-5"]').attr('alt', p5_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-6', p5_6) )});
$('.content img[alt="#photodescription5-6"]').attr('alt', p5_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription5-7', p5_7) )});
$('.content img[alt="#photodescription5-7"]').attr('alt', p5_7);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription6-1', p6_1) )});
$('.content img[alt="#photodescription6-1"]').attr('alt', p6_1);

/*6*/
$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription7-1', p7_1) )});
$('.content img[alt="#photodescription7-1"]').attr('alt', p7_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription7-2', p7_2) )});
$('.content img[alt="#photodescription7-2"]').attr('alt', p7_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription7-3', p7_3) )});
$('.content img[alt="#photodescription7-3"]').attr('alt', p7_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription7-4', p7_4) )});
$('.content img[alt="#photodescription7-4"]').attr('alt', p7_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription8-1', p8_1) )});
$('.content img[alt="#photodescription8-1"]').attr('alt', p8_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription8-2', p8_2) )});
$('.content img[alt="#photodescription8-2"]').attr('alt', p8_2);


$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription8-3', p8_3) )});
$('.content img[alt="#photodescription8-3"]').attr('alt', p8_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription8-4', p8_4) )});
$('.content img[alt="#photodescription8-4"]').attr('alt', p8_4);


$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription8-5', p8_5) )});
$('.content img[alt="#photodescription8-5"]').attr('alt', p8_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription8-6', p8_6) )});
$('.content img[alt="#photodescription8-6"]').attr('alt', p8_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription9-1', p9_1) )});
$('.content img[alt="#photodescription9-1"]').attr('alt', p9_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription9-2', p9_2) )});
$('.content img[alt="#photodescription9-2"]').attr('alt', p9_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription9-3', p9_3) )});
$('.content img[alt="#photodescription9-3"]').attr('alt', p9_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription9-4', p9_4) )});
$('.content img[alt="#photodescription9-4"]').attr('alt', p9_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription9-5', p9_5) )});
$('.content img[alt="#photodescription9-5"]').attr('alt', p9_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription9-6', p9_6) )});
$('.content img[alt="#photodescription9-6"]').attr('alt', p9_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription10-1', p10_1) )});
$('.content img[alt="#photodescription10-1"]').attr('alt', p10_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription10-2', p10_2) )});
$('.content img[alt="#photodescription10-2"]').attr('alt', p10_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription10-3', p10_2) )});
$('.content img[alt="#photodescription10-3"]').attr('alt', p10_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription10-4', p10_4) )});
$('.content img[alt="#photodescription10-4"]').attr('alt', p10_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription10-5', p10_5) )});
$('.content img[alt="#photodescription10-5"]').attr('alt', p10_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription10-6', p10_6) )});
$('.content img[alt="#photodescription10-6"]').attr('alt', p10_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-1', p11_1) )});
$('.content img[alt="#photodescription11-1"]').attr('alt', p11_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-2', p11_2) )});
$('.content img[alt="#photodescription11-2"]').attr('alt', p11_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-3', p11_3) )});
$('.content img[alt="#photodescription11-3"]').attr('alt', p11_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-3', p11_3) )});
$('.content img[alt="#photodescription11-3"]').attr('alt', p11_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-4', p11_4) )});
$('.content img[alt="#photodescription11-4"]').attr('alt', p11_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-5', p11_5) )});
$('.content img[alt="#photodescription11-5"]').attr('alt', p11_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription11-6', p11_6) )});
$('.content img[alt="#photodescription11-6"]').attr('alt', p11_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription12-1', p12_1) )});
$('.content img[alt="#photodescription12-1"]').attr('alt', p12_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription12-2', p12_2) )});
$('.content img[alt="#photodescription12-2"]').attr('alt', p12_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription12-3', p12_3) )});
$('.content img[alt="#photodescription12-3"]').attr('alt', p12_3);


$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription12-4', p12_4) )});
$('.content img[alt="#photodescription12-4"]').attr('alt', p12_4);


$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription12-5', p12_5) )});
$('.content img[alt="#photodescription12-5"]').attr('alt', p12_5);


$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription12-6', p12_6) )});
$('.content img[alt="#photodescription12-6"]').attr('alt', p12_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-1', p13_1) )});
$('.content img[alt="#photodescription13-1"]').attr('alt', p13_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-2', p13_2) )});
$('.content img[alt="#photodescription13-2"]').attr('alt', p13_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-3', p13_3) )});
$('.content img[alt="#photodescription13-3"]').attr('alt', p13_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-4', p13_4) )});
$('.content img[alt="#photodescription13-4"]').attr('alt', p13_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-5', p13_5) )});
$('.content img[alt="#photodescription13-5"]').attr('alt', p13_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-6', p13_6) )});
$('.content img[alt="#photodescription13-6"]').attr('alt', p13_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription13-7', p13_7) )});
$('.content img[alt="#photodescription13-7"]').attr('alt', p13_7);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription14-1', p14_1) )});
$('.content img[alt="#photodescription14-1"]').attr('alt', p14_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription14-2', p14_2) )});
$('.content img[alt="#photodescription14-2"]').attr('alt', p14_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription14-3', p14_3) )});
$('.content img[alt="#photodescription14-3"]').attr('alt', p14_3);


$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription14-4', p14_4) )});
$('.content img[alt="#photodescription14-4"]').attr('alt', p14_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription14-5', p14_5) )});
$('.content img[alt="#photodescription14-5"]').attr('alt', p14_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-1', p15_1) )});
$('.content img[alt="#photodescription15-1"]').attr('alt', p15_1);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-2', p15_2) )});
$('.content img[alt="#photodescription15-2"]').attr('alt', p15_2);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-3', p15_3) )});
$('.content img[alt="#photodescription15-3"]').attr('alt', p15_3);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-4', p15_4) )});
$('.content img[alt="#photodescription15-4"]').attr('alt', p15_4);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-5', p15_5) )});
$('.content img[alt="#photodescription15-5"]').attr('alt', p15_5);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-6', p15_6) )});
$('.content img[alt="#photodescription15-6"]').attr('alt', p15_6);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-7', p15_7) )});
$('.content img[alt="#photodescription15-7"]').attr('alt', p15_7);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-8', p15_8) )});
$('.content img[alt="#photodescription15-8"]').attr('alt', p15_8);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-9', p15_9) )});
$('.content img[alt="#photodescription15-9"]').attr('alt', p15_9);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-aa', p15_aa) )});
$('.content img[alt="#photodescription15-aa"]').attr('alt', p15_aa);

$('.subscription').each(function(){$(this).text( $(this).text().replace('#photodescription15-bb', p15_bb) )});
$('.content img[alt="#photodescription15-bb"]').attr('alt', p15_bb);

});